#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	int a = 10;//4
//	float f = 10.0;//4
//	short a = 10;
//	short int a = 10;
//
//	return 0;
//}

//void test(void)//括号里的void表示函数无参数
//{
//	printf("hehe\n");
//}
//int main()
//{
//	test(100);
//	return 0;
//}
//int main()
//{
//	//对于整型来说存放在其内存中的是二进制补码（计算机系统中，数值一律用补码来表示和存储）
//	//使用补码可以将符号位和数值域统一处理；同时，加法和减法也可以统一处理。
//	int a = 10;//4个字节
//	//00000000000000000000000000001010  --  原码（正数原反补码相同）
//	//00000000000000000000000000001010  --  反码
//	//00000000000000000000000000001010  --  补码
//	int b = -10;
//	//10000000000000000000000000001010  --  原码
//	//11111111111111111111111111110101  --  反码(原码除符号位取反)
//	//11111111111111111111111111110110  --  补码（反码+1）
//	return 0;
//}
//大端（存储）模式：是指数据的低位保存在内存的高地址为上，而数据的高位，保存在内存的低地址位上
//小端（存储）模式：是指数据的低位保存在内存的低地址为上，而数据的高位，保存在内存的高地址位上
//大端小端，描述的是字节的顺序
//int main()
//{
//	int a = 20;
//	return 0;
//}
//int main()
//{
//	int a = 0x22334455;
//	return 0;
//}
//int main()
//{
//	//写一段代码，判断当前机器的字节序是什么
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
//改进：
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	return *p;
//}
//再简化
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
//指针类型的意义：
//1.指针类型决定了指针解引用操作符能访问几个字节：char*p；*p访问了1个字节，int*p；*p访问了4个字节
//2.指针类型决定了指针+1，-1，加的或者减的是几个字节：char*p；p+1跳过一个字节；int*p，p+1跳过一个整型，4个字节
//int main()
//{
//	int a = 0x11223344;
//	int* p = &a;
//	*p = 0;
//	return 0;
//}
//int main()
//{
//	char a = -1;//默认是有符号的
//	//10000000000000000000000000000001(-1的原码)
//	//11111111111111111111111111111110（反码：符号位不变，其他位按位取反）
//	//11111111111111111111111111111111（补码：反码+1）
//	//11111111（char类型只能存8个bit位）
//	//整型提升为11111111111111111111111111111111
//	signed char b = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//整型提升为11111111111111111111111111111111
//	unsigned char c = -1;
//	//10000000000000000000000000000001
//	//01111111111111111111111111111110
//	//01111111111111111111111111111111
//	//整型提升为00000000000000000000000011111111（无符号数高位补0）
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1 -1 255
//	return 0;
//}
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000 - 补码
//	//10000000
//	//11111111111111111111111110000000 - 补码
//	printf("%u\n", a);
//	//%d - 打印十进制有符号数字  
//	//%u - 打印十进制无符号数字
//	return 0;
//}
//有符号的char的范围：-128--127；
//无符号的char的范围：0--255；
//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//	return 0;
//}
//int main()
//{
//	int i = -20;
//	//10000000 00000000 00000000 00010100
//	//11111111 11111111 11111111 11101011
//	//11111111 11111111 11111111 11101100 - 补码
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010 - 原反补码
//	//11111111 11111111 11111111 11110110 - 补码之和
//	//11111111 11111111 11111111 11110101 - 反码
//	//10000000 00000000 00000000 00001010 - 原码
//	printf("%d\n", i + j);
//	return 0;
//}
#include<Windows.h>
//int main()
//{
//	unsigned int i;//无符号数，所有的数都大于0
//	for (i = 9; i >= 0; i--)//死循环
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//		//printf("%d\n", a[i]);
//	}
//	printf("%d", strlen(a));
//	return 0;
//}
//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}
//浮点数家族包括：float，double，long double类型。浮点数表示的范围：float.h
int main()
{
	double d = 1E10;
	printf("%lf\n", d);
	return 0;
}

