#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	int a = 5 / 2;//商2余1,得到的是商 -- 2
//	double b = 5 / 2.0;//商2余1,得到的是商 --2.50000
//	int c = 5 % 2;//商2余1,得到的是余数 -- 1
//	printf("a = %d\n", a);
//	printf("b = %f\n", b);
//	printf("c = %d\n", c);
//	return 0;
//}

//int main()
//{
//	int a = -16;
//	//整数的二进制表示有：原码、反码、补码
//	//存储到内存的是补码
//	//a = -1
//	//10000000000000000000000000000001 -- 原码
//	//11111111111111111111111111111110 -- 反码
//	//11111111111111111111111111111111 -- 补码
//	//>> -- 右移操作符 -- 移动的是二进制位
//	//1.算术右移 - - 右边丢弃，左边补符号位
//	//2.逻辑右移 - - 右边丢弃，左边补0
//	//16 -- 00000000000000000000000000010000
//	//b -- 00000000000000000000000000001000 -- 8
//	int b = a >> 1;
//	printf("b = %d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	//00000000000000000000000000000101
//	//左移后，左边丢弃一位，右边补0
//	//实际有×2的效果
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
	//& -- 按位与（按二进制位）对应的位，有一个为0就为0，两个同时为1则为1
	//| -- 按位或（二进制位）
	//^ -- 按位异或(对应二进制位相同为0，相异为1)
	//int a = 3;//00000000000000000000000000000011
	//int b = 5;//00000000000000000000000000000101
	//int c = a&b;//00000000000000000000000000000001
	//int d = a | b;//00000000000000000000000000000111
	//int e = a^b;//00000000000000000000000000000110
	//printf("%d\n", e);
	//return 0;
//}
//不用第三个变量交换两个变量的值
//1.
//int main()
//{
//	int a = 3;//00000000000000000000000000000011
//	int b = 5;//00000000000000000000000000000101
//	a = a^b;//00000000000000000000000000000110
//	b = a^b;//00000000000000000000000000000011
//	a = a^b;//00000000000000000000000000000101
//	printf("a = %d, b = %d\n", a, b);
//	return 0;
//}
//2.加减法 -- 可能会溢出
//int main()
//{
//	int a = 3;
//	int b = 5;
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("a = %d, b = %d\n", a, b);
//	return 0;
//}

//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);
//	//统计num的补码中1的个数
//	/*while (num)
//	{
//		if (num % 2 == 1)
//			count++;
//		num = num / 2;
//	}*/
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (1 == ((num >> i) & 1))
//			count++;
//	}
//	printf("count = %d\n", count);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	/*a = a + 2;//符合赋值符（+= -= *= /= %= >>= <<= &= |= ^=）
//	a += 2;
//	a = a >> 1;
//	a >>= 1;
//	a = a & 1;
//	a &= 1;*/
//	return 0;
//}

//单目操作符 -- 只有一个操作数
//int main()
//{
//	int a = 10;
//	int* p = &a;//取地址符
//	*p = 20;//解引用符
//	printf("%d\n", a);
//	return 0;
//}

//int main()
//{
//	short s = 0;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 5));
//	printf("%d\n", s);
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	//00000000000000000000000000000000
//	//11111111111111111111111111111111 - 反码
//	//11111111111111111111111111111110 - 补码
//	//10000000000000000000000000000001 - 原码
//	printf("%d\n", ~a);//~按（2进制）位取反// -1
//	return 0;
//}

//int main()
//{
//	int a = 11;//00000000000000000000000000001011
//	a = a | (1 << 2);
//	printf("%d\n", a);//15
//
//	return 0;
//}

//int main()
//{
//	int a = (int)3.14;//强制类型转换
//	return 0;
//}

//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//40
//	printf("%d\n", sizeof(ch));//10
//	test1(arr);//传的是首元素地址-4字节
//	test2(ch);//传的也是首元素地址，需要一个指针来接受-4字节
//	return 0;
//}
//&&逻辑与
//||逻辑或
//int main()
//{
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//  //i = a++||++b||d++;
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//1 2 3 4逻辑与，左边算出为假（0），不管右边有什么都不继续计算
//2 2 3 4逻辑或，左边算出为真，不管右边有什么都不继续进行计算
//	return 0;
//}

//exp1？exp2：exp3（表达式1结果为真，按表达式2计算结果，为假，按表达式3计算结果）
//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d", &a);
//	b = (a > 5 ? 3 : -3);
//	printf("b = %d\n", b);
//	return 0;
//}

int main()
{
	return 0;
}